hexeguitar/ESP32_TFT_PIO/Examples/CYD28_BaseProject/lib/CYD_Audio/src/CYD_Audio.cpp
    if(!m_stsz_position) return m_audioDataStart; // guard

    typedef union{
        uint8_t     u8[4];
        uint32_t    u32;
    } tu;
    tu uu;

    uint32_t i = 0, pos = m_audioDataStart;
    audiofile.seek(m_stsz_position);

    while(i < m_stsz_numEntries){
        i++;
        uu.u8[3] =  audiofile.read();
        uu.u8[2] =  audiofile.read();
        uu.u8[1] =  audiofile.read();
        uu.u8[0] =  audiofile.read();
        pos += uu.u32;
        if(pos >= resumeFilePos) break;
    }
    return pos;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t CYD_Audio::flac_correctResumeFilePos(uint32_t resumeFilePos){
    // The starting point is the next FLAC syncword
    uint8_t p1, p2;
    boolean found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    pos+=2;
    while(!found || pos == m_file_size){
        if(p1 == 0xFF && p2 == 0xF8){found = true; log_i("found"); break;}
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }

    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t CYD_Audio::mp3_correctResumeFilePos(uint32_t resumeFilePos){
    // The starting point is the next MP3 syncword
    uint8_t p1, p2;
    boolean found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    pos+=2;
    while(!found || pos == m_file_size){
        if(p1 == 0xFF && (p2 & 0xF0) == 0xF0){found = true; break;}
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }
    MP3Decoder_ClearBuffer();
    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint8_t CYD_Audio::determineOggCodec(uint8_t* data, uint16_t len){
    // if we have contentType == application/ogg; codec cn be OPUS, FLAC or VORBIS
    // let's have a look, what it is
    int idx = specialIndexOf(data, "OggS", 6);
    if(idx != 0){
        if(specialIndexOf(data, "fLaC", 6)) return CODEC_FLAC;
        return CODEC_NONE;
    }
    data += 27;
    idx = specialIndexOf(data, "OpusHead", 40);
    if(idx >= 0) return CODEC_OPUS;
    idx = specialIndexOf(data, "fLaC", 40);
    if(idx >= 0) return CODEC_FLAC;
    idx = specialIndexOf(data, "vorbis", 40);
    if(idx >= 0){log_i("vorbis"); return CODEC_VORBIS;}
    return CODEC_NONE;
}
//----------------------------------------------------------------------------------------------------------------------

